update with 6 sections
